---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPosition
source: html/5ea7fd68-91a5-9705-1769-0705d435a5b8.htm
---
# VertexStreamPosition Methods

Inserts a VertexStreamPosition into the stream and associated buffer.